Revit 2027 API
Element.CanDeleteSubelement Method
 Checks if given subelement can be removed from the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanDeleteSubelement(
	Subelement subelem
)
Public Function CanDeleteSubelement (
	subelem As Subelement
) As Boolean
public:
bool CanDeleteSubelement(
	Subelement^ subelem
)
member CanDeleteSubelement :
        subelem : Subelement -> bool
Parameters
subelem Subelement
 Subelement to check.
Return Value
Boolean
 True if subelement can be removed, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace